alp ={ 'a1': "А, а",'a2':"Б,б", 'a3':"В,в",'a4':"Г,г",'a5': "Г,г",'a6':"Д,д",
      'a7':"Е,е",'a8':"Є,є",'a9':"Ж,ж",'a10':"З,з" ,
      'a11':"И,и",'a12':"І,і",'a13':"Ї,ї",'a14':"Й,й",'a15':"К,к",'a16':"Л,л",'a17':"М,м",'a18':"Н,н"
      ,'a19':"О,о",'a20':"П,п",'a21':"Р,р",'a22':"С,с",'a23':"Т,т",'a24':"У,у",'a25':"Ф,ф",'a26':"Х,х"
      ,'a27':"Ц,ц",'a28':"Ч,ч",'a29':"Ш,ш",'a30':"Щ,щ",'a31':"ь",'a32':"Ю,ю",'a33':"Я,я"}

print (alp)
for i in alp:
    print(" У алфавіті 33 букви напишіть яка по рахунку вам потрібна, приклад'тридцять третя '")
    print("прохання не писати апостроф де він потрібний ")
    q= input("введіть яка по рахунку буква:")
    if q== "перша" :
     print (alp["a1"])
    if q== "друга" :
     print (alp["a2"])
    if q== "третя" :
     print (alp["a3"])
    if q== "четверта" :
     print (alp["a4"])
    if q== "пята" :
     print (alp["a5"])
    if q== "шоста" :
     print (alp["a6"])     
    if q== "сьома" :
     print (alp["a7"]) 
    if q== "восьма" :
     print (alp["a8"])
    if q== "девята" :
     print (alp["a9"])  
    if q== "десята" :
     print (alp["a10"])
    if q== "одинадцята" :
     print (alp["a11"])
    if q== "дванадцята" :
     print (alp["a12"])
    if q== "тринадцята" :
     print (alp["a13"])
    if q== "чотирнадцята" :
     print (alp["a14"])  
    if q== "пятнадцята" :
     print (alp["a15"]) 
    if q== "шістнадцята" :
     print (alp["a16"]) 
    if q== "сімнадцята" :
     print (alp["a17"])
    if q== "вісімнадцята" :
     print (alp["a18"])
    if q== "девятнадцята" :
     print (alp["a19"])
    if q== "двадцята" :
     print (alp["a20"]) 
    if q== "двадцять перша" :
     print (alp["a21"])  
    if q== "двадцять друга" :
     print (alp["a22"])  
    if q== "двадцять третя" :
     print (alp["a23"]) 
    if q== "двадцять четверта" :
     print (alp["a24"]) 
    if q== "двадцять пята " :
     print (alp["a25"])
    if q== "двадцять шоста" :
     print (alp["a26"])  
    if q== "двадцять сьома" :
     print (alp["a27"])  
    if q== "двадцять восьма " :
     print (alp["a28"]) 
    if q== "двадцять девята " :
     print (alp["a29"]) 
    if q== "тридцята" :
     print (alp["a30"])
    if q== "тридцять перша" :
     print (alp["a31"])
    if q== "тридцять друга" :
     print (alp["a32"])  
    if q== "тридцять третя" :
     print (alp["a33"])  